# Pandas
=> Pandas is an open source library built on top of NumPy

=> It allows for fast analysis and data clearning and preparation

=> It excels in performance and productivity

=> It also has built in visualization features.

=> It can work with data from a wide variety of sources.

pip instll pandas

* Series

* DataFrames

* Missing Data

* GroupBy

* Merging, Joining and Concaenating

* Operations

* Data Input and Output

## Series
It is similar to numpy array

In [1]:
import pandas as pd
import numpy as np

format of series 

Series(data=    , index=     )

=> It work like a dictionary with index

In [2]:
lables = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [3]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
 pd.Series(data = my_data, index=lables)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_data,lables)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr,lables)

a    10
b    20
c    30
dtype: int64

In [7]:
d

{'a': 10, 'b': 20, 'c': 30}

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(data=lables)

0    a
1    b
2    c
dtype: object

In [10]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [11]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','India'])
ser1

USA        1
Germany    2
USSR       3
India      4
dtype: int64

In [12]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','India'])
ser2

USA        1
Germany    2
Italy      5
India      4
dtype: int64

In [13]:
ser1['USA']

1

In [14]:
ser3= pd.Series(data=lables)
ser3

0    a
1    b
2    c
dtype: object

In [15]:
ser3[0]

'a'

In [16]:
ser1

USA        1
Germany    2
USSR       3
India      4
dtype: int64

In [17]:
ser2

USA        1
Germany    2
Italy      5
India      4
dtype: int64

In [18]:
ser1 + ser2

Germany    4.0
India      8.0
Italy      NaN
USA        2.0
USSR       NaN
dtype: float64

## Data Frames

axis 0 means rows

axis 1 means columns

In [19]:
 from numpy.random import randn

In [20]:
np.random.seed(101)

In [21]:
data = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [22]:
data

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
data.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [24]:
type(data['W'])

pandas.core.series.Series

In [25]:
type(data)

pandas.core.frame.DataFrame

In [26]:
data[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [27]:
data['New'] = data['W'] + data['X']
data

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

### droping columns

In [28]:
# is the inspace= True then only data can remove permanetly
data.drop('New',axis=1,inplace=True)

In [29]:
data

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
### dropping rows

In [31]:
data.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [32]:
data

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
data.shape

(5, 4)

In [34]:
data

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### selecting rows

In [35]:
data.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [36]:
data.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [37]:
data.loc['B','Y']

-0.8480769834036315

In [38]:
data.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

## Conditional Selection

In [39]:
data > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [40]:
booldata = data > 0
data[booldata]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
data[data>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
data['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [43]:
data.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [44]:
result = data[data['W']>0]
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
result['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [46]:
 result = data[data['W'] > 0]['X']

In [47]:
result

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [48]:
result1 = data[data['W'] > 0][['X','Y','Z']] 
result1

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [49]:
boolser = data['W'] > 0 
boolser

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [50]:
result = data[boolser]
mycols=['Y','X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [51]:
data[data['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
data[(data['W']>0) & (data['X']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [53]:
data[(data['W']>0) | (data['X']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### making Index

In [54]:
# if want to permanet this index the insert insplace = True
data.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [55]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [56]:
data['States'] = newind

In [57]:
data

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [58]:
data

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [59]:
data.set_index('States', inplace=True)
data

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

### Index Levels

In [60]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [61]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [62]:
inside

[1, 2, 3, 1, 2, 3]

In [63]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [64]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [65]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [66]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [67]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [68]:
# giving name to index
df.index.names=['Groups','Num']
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [69]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [70]:
df.loc['G1'].loc[3][0]

-0.13484072060601238

In [71]:
df.xs

<bound method NDFrame.xs of                    A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646>

In [72]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [73]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [74]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

## Missing Data

In [75]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [76]:
df= pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [77]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [78]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [79]:
  df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [80]:
df.fillna(value="FILL VALUE")

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [81]:
# df['A'].fillna(value="FILL VALUE",inplace=True)
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [82]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## GroupBy

Groupby allows you to group together rows based off of a colummn and perform an aggregate function on them.

In [83]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]
       }

In [84]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [85]:
df.index.names=['Sr No.']

In [86]:
df

       Company   Person  Sales
Sr No.
0         GOOG      Sam    200
1         GOOG  Charlie    120
2         MSFT      Amy    340
3         MSFT  Vanessa    124
4           FB     Carl    243
5           FB    Sarah    350

In [87]:
byComp = df.groupby('Company')

In [88]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [89]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [90]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [91]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [92]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [93]:
df.groupby('Company').max()
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [94]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

## Merging, Joining, and Concatenating
There are 3 main ways of combining DataFrames togethe: Marging, Joining and Concatenating.

In [95]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']
                   })

In [96]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [97]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'],
                   'D':['D4','D5','D6','D7']
                   })

In [98]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [99]:
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                   'B':['B8','B9','B10','B11'],
                   'C':['C8','C9','C10','C11'],
                   'D':['D8','D9','D10','D11']
                   })

In [100]:
df3

     A    B    C    D
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

## Concatenation
Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use pd.concat and pass in a list of DataFrames to concatenate together:

In [101]:
pd.concat([df1,df2,df3])

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C7   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [102]:
pd.concat([df1,df2,df3],axis=1)

    A   B   C   D   A   B   C   D    A    B    C    D
0  A0  B0  C0  D0  A4  B4  C4  D4   A8   B8   C8   D8
1  A1  B1  C1  D1  A5  B5  C5  D5   A9   B9   C9   D9
2  A2  B2  C2  D2  A6  B6  C6  D6  A10  B10  C10  D10
3  A3  B3  C3  D3  A7  B7  C7  D7  A11  B11  C11  D11

## Marging 
The merge function allows you to merge DataFrames together using a similar logic and merging SQL tables together, For example:

In [103]:
left = pd.DataFrame({'key':['KO','K1','K2','K3'],
                    'A': ['AO','A1','A2','A3'],
                    'B': ['BO','B1','B2','B3'] 
                    })

right = pd.DataFrame({
                    'A': ['AO','A1','A2','A3'],
                    'B': ['BO','B1','B2','B3'],
                    'key':['KO','K1','K2','K3']
                    })

In [104]:
left

  key   A   B
0  KO  AO  BO
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [105]:
right

    A   B key
0  AO  BO  KO
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [106]:
pd.merge(left,right,how='outer',on='key')

  key A_x B_x A_y B_y
0  KO  AO  BO  AO  BO
1  K1  A1  B1  A1  B1
2  K2  A2  B2  A2  B2
3  K3  A3  B3  A3  B3

 ## Joining
 joining is convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [107]:
left = pd.DataFrame({
                    'A': ['AO','A1','A2','A3'],
                    'B': ['BO','B1','B2','B3']},
                    index=['KO','K1','K2','K3']
                    )

right = pd.DataFrame({
                    'C': ['AO','A1','A2','A3'],
                    'D': ['BO','B1','B2','B3']},
                    index=['KO','K1','K2','K3']
                    )

In [108]:
left

     A   B
KO  AO  BO
K1  A1  B1
K2  A2  B2
K3  A3  B3

In [109]:
right

     C   D
KO  AO  BO
K1  A1  B1
K2  A2  B2
K3  A3  B3

In [110]:
left.join(right)

     A   B   C   D
KO  AO  BO  AO  BO
K1  A1  B1  A1  B1
K2  A2  B2  A2  B2
K3  A3  B3  A3  B3

In [111]:
left.join(right, how = 'outer')

     A   B   C   D
KO  AO  BO  AO  BO
K1  A1  B1  A1  B1
K2  A2  B2  A2  B2
K3  A3  B3  A3  B3

## Pandas -Operations

In [112]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2' :[444,555,666,444],
                   'col3' :['abc','def','ghi','xyz']
                  })
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [113]:
# it'shows all unique elements
df['col2'].unique()

array([444, 555, 666])

In [114]:
# It's shows count of all unique elements.
df['col3'].nunique()

4

In [115]:
# It show count of perticular value in column
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [116]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [117]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

We can apply any function on data using 'apply' method

In [118]:
def times2(x):
    return x*2

In [119]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [120]:
# we can apply built in function
df['col1'].apply(lambda x : x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [121]:
df.drop('col1',axis=1,inplace=False)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [122]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [123]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [124]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [125]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [126]:
# We can sort values by any column.
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [137]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1]
       }
df=pd.DataFrame(data)

# this export and save this data frame in files
df.to_csv('example.csv',index=False)
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

In [133]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

### Python Input and Output

* CSV

* Excel

* HTML

* SQL

=> You'll need to install with pip or conda:

conda install sqlalchemy

conda install lxml

conda install html5lib

conda install BeautifulSoup4

In [129]:
pwd  # This shows file location

'/home/automatonai/Desktop/Vishal/Python Code'

In [130]:
pd.read_csv('example.csv')

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [131]:
pip install xlrd

Requirement already satisfied: xlrd in /home/automatonai/anaconda3/lib/python3.8/site-packages (1.2.0)

[notice] A new release of pip available: 22.3.1 -> 23.1.2
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [140]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0    A    B  C  D
0           0  foo  one  x  1
1           1  foo  one  y  3
2           2  foo  two  x  2
3           3  bar  two  y  5
4           4  bar  one  x  4
5           5  bar  one  y  1

## Reading HTML Data Base

In [146]:
data=pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [150]:
data[0].head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
1,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
2,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539
3,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
4,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537

In [151]:
from sqlalchemy import create_engine

In [153]:
engine = create_engine('sqlite:///:memory:')

In [155]:
df.to_sql('my_table',engine)

6

In [157]:
sqldf = pd.read_sql('my_table',con=engine)

In [158]:
sqldf

   index    A    B  C  D
0      0  foo  one  x  1
1      1  foo  one  y  3
2      2  foo  two  x  2
3      3  bar  two  y  5
4      4  bar  one  x  4
5      5  bar  one  y  1

In [162]:
pwd

'/home/automatonai/Desktop/Vishal/Python Code'

In [165]:
sal = pd.read_csv('/home/automatonai/Desktop/Vishal/Python Code/Salaries.csv')

<ipython-input-165-99664fea4e7a>:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  sal = pd.read_csv('/home/automatonai/Desktop/Vishal/Python Code/Salaries.csv')

In [167]:
sal.head(2)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN

In [170]:
# Use the .info() method to find out how many entries there are.
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [199]:
# mean of the BasePay

sal[sal['BasePay']=='Not Provided']=0

In [206]:
sal['BasePay'].describe()

count     148049.0
unique    109899.0
top            0.0
freq         879.0
Name: BasePay, dtype: float64

In [207]:
sal['BasePay'] = sal['BasePay'].astype(float)

In [208]:
sal.describe()

,Id,BasePay,TotalPay,TotalPayBenefits,Year,Notes,False
count,148654.000000,148049.000000,148654.000000,148654.000000,148654.000000,4.0,148654.0
mean,74323.500087,66323.656854,74768.321972,93692.554811,2012.468450,0.0,0.0
std,42912.857807,42765.447379,50517.005274,62793.533483,10.499104,0.0,0.0
min,0.000000,-166.010000,-618.130000,-618.130000,0.000000,0.0,0.0
25%,37160.250000,33583.520000,36168.995000,44065.650000,2012.000000,0.0,0.0
50%,74323.500000,65006.930000,71426.610000,92404.090000,2013.000000,0.0,0.0
75%,111486.750000,94691.050000,105839.135000,132876.450000,2014.000000,0.0,0.0
max,148654.000000,319275.010000,567595.430000,567595.430000,2014.000000,0.0,0.0

In [209]:
sal.BasePay.mean()

66323.65685410085

In [215]:
# Finding the highest amount of OvertimePay in the database
sal['OvertimePay'] = sal['OvertimePay'].astype(float)
sal['OvertimePay'].max()

245131.88

In [216]:
sal

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,False
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN,0
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN,0
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN,0
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN,0
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT,0
148650,0,0,0,0.00,0.00,0,0,0.00,0.00,0,0.0,0,0,0
148651,0,0,0,0.00,0.00,0,0,0.00,0.00,0,0.0,0,0,0
148652,0,0,0,0.00,0.00,0,0,0.00,0.00,0,0.0,0,0,0
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT,0

In [227]:
# finding job tilte of perticular employee
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [229]:
# finding totalPayBenefits fo particular employee
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [231]:
sal.head(1)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,False
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN,0

In [234]:
# finding name of highest total pay persion
sal[sal['TotalPay']==sal['TotalPay'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [243]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].min()][['EmployeeName','TotalPayBenefits']]

       EmployeeName  TotalPayBenefits
148653    Joe Lopez           -618.13

In [244]:
# how many unique job titles are there?
sal['JobTitle'].nunique()

2159

In [250]:
# What was the average(mean) BasePy of all employees per year? (2011-2014)
avsSal = sal.groupby('Year').mean()['BasePay']
avsSal
# avsSal['BasePay'].mean()

Year
0           0.000000
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [255]:
# What are the top 5 most common jobs?
sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [293]:
sal['JobTitle'] = sal['JobTitle'].astype(object)

sum(sal[sal['Year']==2013]['JobTitle'].value_counts()==1)

202

In [294]:
def chief_string(title):
    if 'chief' in title.lower().split():
        return True
    else:
        return False

In [295]:
# sal['JobTitle'].apply(lambda x: chief_string(x))

In [288]:
# Bonus : Is there a correlation between length of the Job Title string and Salary

# sal['title_len'] = sal['JobTitle'].apply(len)
# sal[['JobTitle','title_len']].corr()

TypeError: object of type 'int' has no len()

In [337]:
ecom = pd.read_csv('Ecommerce Purchases.csv')
ecom.head()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [297]:
ecom.shape

(10000, 14)

In [298]:
ecom.columns

Index(['Address', 'Lot', 'AM or PM', 'Browser Info', 'Company', 'Credit Card',
       'CC Exp Date', 'CC Security Code', 'CC Provider', 'Email', 'Job',
       'IP Address', 'Language', 'Purchase Price'],
      dtype='object')

In [299]:
len(ecom.index)

10000

In [300]:
ecom.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Address           10000 non-null  object
 1   Lot               10000 non-null  object
 2   AM or PM          10000 non-null  object
 3   Browser Info      10000 non-null  object
 4   Company           10000 non-null  object
 5   Credit Card       10000 non-null  int64
 6   CC Exp Date       10000 non-null  object
 7   CC Security Code  10000 non-null  int64
 8   CC Provider       10000 non-null  object
 9   Email             10000 non-null  object
 10  Job               10000 non-null  object
 11  IP Address        10000 non-null  object
 12  Language          10000 non-null  object
 13  Purchase Price    10000 non-null  float64
dtypes: float64(1), int64(2), object(11)
memory usage: 1.1+ MB

In [303]:
ecom['Purchase Price'].mean()

50.34730200000025

In [306]:
ecom['Purchase Price'].min()

0.0

In [307]:
ecom['Purchase Price'].max()

99.99

In [321]:
ecom[ecom['Language'] == 'en']['Language'].count()

1098

In [322]:
ecom.columns

Index(['Address', 'Lot', 'AM or PM', 'Browser Info', 'Company', 'Credit Card',
       'CC Exp Date', 'CC Security Code', 'CC Provider', 'Email', 'Job',
       'IP Address', 'Language', 'Purchase Price'],
      dtype='object')

In [325]:
ecom[ecom['Job']=='Lawyer']['Job'].count()
len(ecom[ecom['Job']=='Lawyer'].index)

30

In [332]:
ecom['AM or PM'].value_counts()

AM or PM  AM or PM
AM        AM          4932
PM        PM          5068
Name: AM or PM, dtype: int64

In [335]:
ecom['Job'].value_counts().head(5)

AM or PM  Job
AM        Social worker                      17
          Psychotherapist, dance movement    16
          Armed forces technical officer     15
          Art therapist                      15
          Charity fundraiser                 15
Name: Job, dtype: int64

In [338]:
ecom.head(2)

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73

In [345]:
ecom[ecom['Lot'] == '90 WT']['Purchase Price']

513    75.1
Name: Purchase Price, dtype: float64

In [348]:
ecom[ecom['Credit Card']==4926535242672853]['Email']

1234    bondellen@williams-garza.com
Name: Email, dtype: object

In [356]:
len(ecom[(ecom['CC Provider']=='American Express') & (ecom['Purchase Price']>95)])

39

In [366]:
len(ecom[ecom['CC Exp Date'].apply(lambda exp: exp[3:]=='25')])

1033

In [428]:
ecom['Email'].apply(lambda email:email.split('@')[1]).value_counts().head(5)

hotmail.com     1638
yahoo.com       1616
gmail.com       1605
smith.com         42
williams.com      37
Name: Email, dtype: int64

In [ ]:
0.002 \1000